Revit 2027 API
CurtainGrid.GetUnlockedMullionIds Method
 Gets all ElementIds of the unlocked mullions of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetUnlockedMullionIds()
Public Function GetUnlockedMullionIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetUnlockedMullionIds()
member GetUnlockedMullionIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The unlocked mullion ElementIds
Remarks
 ElementIds are of Mullion Elements.
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace